code-review/NRB_3471_3546/База_Было/InformationRegisters/СостоянияДокументовВФайловомШлюзе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовВФайловомШлюзе</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсходящийПакетВФайловыйШлюз</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийПакетИзФайловогоШлюза</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИсполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/НеттоПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НеттоПоручение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсполнениеПоручения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлиентаВнешнегоБрокера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаВышестоящегоДепозитария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийНеограниченнойДлины</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаРасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Референс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>Ценная бумага</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоручения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнвентарныхПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ТехническаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТехническаяОперация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомерВнутриДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер поручения/распоряжения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационнаяДата</Name>
					<Comment>Дата и время регистрации поручения/распоряжения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий1024</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьИнвестиционныйЦентр</Name>
					<Comment>Оповестить Инвестиционный центр</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/ВидыИнвентарныхПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыИнвентарныхПоручений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФорматПоручения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматыИнвентарныхПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтображения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонИсходящегоНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/РеквизитыИнвентарныхПорученийСервер/Ext/Module.bsl
Процедура ЗаполнитьРеквизитыПоручения(Ссылка, Форма) Экспорт
	Если НЕ ЗначениеЗаполнено(Ссылка.ВидПоручения) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Поручение") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		|	НеттоПоручениеПоручения.Поручение
		|ИЗ
		|	Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
		|ГДЕ
		|	НеттоПоручениеПоручения.Поручение = &Ссылка
		|	И НЕ НеттоПоручениеПоручения.Ссылка.ПометкаУдаления";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	МакетОтображения = Ссылка.ВидПоручения.НастройкиОтображения.Получить();
	Если МакетОтображения = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	//СКД = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("РеквизитыПоручения");
	СКД = Ссылка.ВидПоручения.СхемаКомпоновкиДанных.Получить();
	Если СКД = Неопределено Тогда
		СКД = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("РеквизитыПоручения");
	КонецЕсли; 
	
	СоздатьЭлементыФормы(Форма, МакетОтображения, Ссылка.ВидПоручения);
	
	//ЗаполнитьЭлементыФормы(Ссылка, Форма, СКД, "Поручение");
	Для каждого НаборДанных Из СКД.НаборыДанных Цикл
		Если Найти(НаборДанных.Имя, "ТЧ_") > 0 Тогда
			ЗаполнитьТаблицуФормы(Ссылка, Форма, СКД, НаборДанных.Имя);
		Иначе
			ЗаполнитьЭлементыФормы(Ссылка, Форма, СКД, НаборДанных.Имя);
		КонецЕсли; 
	КонецЦикла; 
	
	ЗаполнитьСтатус_ФШ(Ссылка, Форма);
	
	//ЗаполнитьТаблицуФормы(Ссылка, Форма, СКД, "ДополнительнаяИнформация");
	//ЗаполнитьТаблицуФормы(Ссылка, Форма, СКД, "Документы");
	
	УдалитьНезаполненныеЭлементыФормы(Форма);
КонецПроцедуры

Процедура СоздатьЭлементыФормы(Форма, МакетОтображения, ВидПоручения)
	//МакетОтображения = Объект.ВидПоручения.НастройкиОтображения.Получить();
	
	НомераКолонок = Новый Соответствие;
	НомераКолонок.Вставить("Значение", 5);
	НомераКолонок.Вставить("Группа", 7);
	НомераКолонок.Вставить("Элемент", 6);
	НомераКолонок.Вставить("НомерГруппы", 9);
	НомераКолонок.Вставить("НомерЭлемента", 10);
	НомераКолонок.Вставить("Видимость", 8);
	НомераКолонок.Вставить("Обязательное", 11);
	НомераКолонок.Вставить("Таблица", 2);
	НомераКолонок.Вставить("ПолеБлока", 4);
	НомераКолонок.Вставить("КолонкаНаФорме", 13);
	
	УдаляемыеРеквизиты = Новый Массив;
	УдаляемыеЭлементы = Новый Массив;
	//Для каждого СтрокаРеквизит Из Форма.ТаблицаРеквизитов Цикл
	//	Если Форма.ПолучитьРеквизиты().Найти(СтрокаРеквизит.ИмяЭлемента) <> Неопределено Тогда
	//		УдаляемыеРеквизиты.Добавить(Форма[СтрокаРеквизит.ИмяЭлемента]);
	//	КонецЕсли; 
	//	
	//	//Если Форма.Элементы.Найти(СтрокаРеквизит.ИмяЭлемента) <> Неопределено Тогда
	//	//	УдаляемыеЭлементы.Добавить(СтрокаРеквизит.ИмяЭлемента);
	//	//КонецЕсли; 
	//	
	//КонецЦикла; 
	Для каждого РеквизитФормы Из Форма.ПолучитьРеквизиты() Цикл
		Если Найти(РеквизитФормы.Имя, "Реквизит_") > 0 ИЛИ Найти(РеквизитФормы.Имя, "Таблица_") > 0 Тогда
			УдаляемыеРеквизиты.Добавить(РеквизитФормы.Имя);
		КонецЕсли; 
	КонецЦикла; 
	Для каждого ЭлементФормы Из Форма.Элементы Цикл
		
		//Если Найти(ЭлементФормы.Имя, "ВспомГруппа_") > 0 Тогда
		Если Найти(ЭлементФормы.Имя, "Группа_") > 0 Тогда
			УдаляемыеЭлементы.Добавить(ЭлементФормы.Имя);
		КонецЕсли; 
	КонецЦикла; 
	Для каждого ЭлементУдалить Из УдаляемыеЭлементы Цикл
		Попытка
		
			Форма.Элементы.Удалить(Форма.Элементы[ЭлементУдалить]);
		
		Исключение
		
		КонецПопытки;
		
	КонецЦикла; 
	
	Форма.ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
	Форма.ТаблицаРеквизитов.Очистить();
	
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	ТаблицаОтображения = Новый ТаблицаЗначений;
	ТаблицаОтображения.Колонки.Добавить("ИмяГруппы");
	ТаблицаОтображения.Колонки.Добавить("ИмяЭлемента");
	ТаблицаОтображения.Колонки.Добавить("НомерГруппы");
	ТаблицаОтображения.Колонки.Добавить("НомерЭлемента");
	ТаблицаОтображения.Колонки.Добавить("ИмяРеквизита");
	ТаблицаОтображения.Колонки.Добавить("ИмяТаблицы");
	ТаблицаОтображения.Колонки.Добавить("ФорматнаяСтрока");
	ТаблицаОтображения.Колонки.Добавить("Видимость");
	ТаблицаОтображения.Колонки.Добавить("Обязательное");
	ТаблицаОтображения.Колонки.Добавить("ПолеБлока");
	ТаблицаОтображения.Колонки.Добавить("ЭтоТаблица");
	ТаблицаОтображения.Колонки.Добавить("КолонкаНаФорме");
	
	Для НомерСтроки = 2 По МакетОтображения.ВысотаТаблицы Цикл
		ИмяГруппы = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Группа"]).Текст;
		ИмяЭлемента = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Элемент"]).Текст;
		ПолеБлока = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["ПолеБлока"]).Текст;
		НомерГруппы = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["НомерГруппы"]).Текст;
		НомерЭлемента = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["НомерЭлемента"]).Текст;
		ИмяРеквизита = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Значение"]).Текст;
		ФорматнаяСтрока = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Значение"]).Формат;
		Видимость = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Видимость"]).Текст;
		Обязательное = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Обязательное"]).Текст;
		ИмяТаблицы = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Таблица"]).Текст;
		ЭтоТаблица = ЗначениеЗаполнено(МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Таблица"]).Текст);
		КолонкаНаФорме = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["КолонкаНаФорме"]).Текст;
		
		Если ЭтоТаблица И Найти(ИмяГруппы, "(таблица)") = 0 Тогда
			ИмяГруппы = ИмяГруппы + " (таблица)";
		КонецЕсли;
		
		НовСтрока = ТаблицаОтображения.Добавить();
		НовСтрока.ИмяГруппы = ИмяГруппы;
		НовСтрока.ИмяЭлемента = ИмяЭлемента;
		НовСтрока.НомерГруппы = НомерГруппы;
		НовСтрока.НомерЭлемента = НомерЭлемента;
		НовСтрока.ИмяРеквизита = ИмяРеквизита;
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.ФорматнаяСтрока = ФорматнаяСтрока;
		НовСтрока.Видимость = Видимость;
		НовСтрока.Обязательное = Обязательное;//ЗначениеЗаполнено(Обязательное) ИЛИ ВРЕГ(Обязательное) = "НЕТ";
		НовСтрока.ЭтоТаблица = ЭтоТаблица;
		НовСтрока.ПолеБлока = ПолеБлока;
		НовСтрока.КолонкаНаФорме = КолонкаНаФорме;
	КонецЦикла;		
	
	ТаблицаОтображения.Сортировать("НомерГруппы, НомерЭлемента"); 
	
	ИсправитьКолонкиНаФормеНаРазрешенныеЗначения(ТаблицаОтображения, ВидПоручения);
	ИсправитьКолонкиНаФормеНаОдноЗначениеВнутриГруппы(ТаблицаОтображения, ВидПоручения);
	КолонкиГруппы = КолонкиГруппНаФорме(ТаблицаОтображения);
	СоздатьКолонкиНаФорме(Форма, Форма.Элементы.СтраницаРеквизиты, ТаблицаОтображения);
	
	ДобавленныеГруппы = Новый Массив;
	ДобавленныеТаблицы = Новый Массив;
	
	Для каждого Строка Из ТаблицаОтображения Цикл
		
		Если ДобавленныеГруппы.Найти(Строка.ИмяГруппы) = Неопределено Тогда
			//ЧислоНомерГруппы = Число(Строка.НомерГруппы);
			//Если ЧислоНомерГруппы/2 = Цел(ЧислоНомерГруппы/2) Тогда
			//	ВспомГруппаФормы = Форма.Элементы.Добавить("ВспомГруппа_" + Цел(ЧислоНомерГруппы/2), Тип("ГруппаФормы"), Форма.Элементы.СтраницаРеквизиты);	
			//	ВспомГруппаФормы.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
			//	ВспомГруппаФормы.Отображение                = ОтображениеОбычнойГруппы.Нет;
			//	ВспомГруппаФормы.ОтображатьЗаголовок        = ЛОжь;
			//	ВспомГруппаФормы.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			//Иначе
			//	ВспомГруппаФормы = Форма.Элементы["ВспомГруппа_" + Цел(ЧислоНомерГруппы/2)];
			//КонецЕсли; 
			
			//ГруппаФормы = Форма.Элементы.Добавить("Группа_" + Строка.НомерГруппы, Тип("ГруппаФормы"), ВспомГруппаФормы);
			
			ГруппаРодитель = Форма.Элементы["РеквизитыКолонка" + КолонкиГруппы[Строка.НомерГруппы]];
			ГруппаФормы = Форма.Элементы.Добавить("Группа_" + Строка.НомерГруппы, Тип("ГруппаФормы"), ГруппаРодитель);
			ГруппаФормы.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаФормы.Отображение                = ОтображениеОбычнойГруппы.СлабоеВыделение;
			ГруппаФормы.Заголовок                  = Строка.ИмяГруппы;
			ГруппаФормы.ОтображатьЗаголовок        = Истина;
			ГруппаФормы.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			ДобавленныеГруппы.Добавить(Строка.ИмяГруппы);
		Иначе
			ГруппаФормы = Форма.Элементы["Группа_" + Строка.НомерГруппы];
		КонецЕсли; 
		
		Если Не ПустаяСтрока(Строка.ИмяЭлемента) Тогда
			ЗаголовокРеквизита = Строка.ИмяЭлемента;
			ИмяРеквизита = Строка.ИмяРеквизита;
			
			Если Строка.ЭтоТаблица Тогда
				Если ДобавленныеТаблицы.Найти(Строка.ИмяГруппы) = Неопределено Тогда
					РеквизитТаблица = Новый РеквизитФормы("Таблица_" + Строка.НомерГруппы, Новый ОписаниеТипов("ТаблицаЗначений"), , Строка.ИмяГруппы);
					ДобавляемыеРеквизиты.Добавить(РеквизитТаблица);
					
					НоваяСтрока = Форма.ТаблицаРеквизитов.Добавить();
					НоваяСтрока.Имя 	        = "";
					НоваяСтрока.ИмяЭлемента     = "Таблица_" + Строка.НомерГруппы;
					НоваяСтрока.Заголовок       = Строка.ИмяГруппы;
					НоваяСтрока.ПутьКДанным     = "Таблица_" + Строка.НомерГруппы;
					НоваяСтрока.Родитель		= ГруппаФормы.Имя;
					НоваяСтрока.Видимость		= Строка.Видимость;
					
					ДобавленныеТаблицы.Добавить(Строка.ИмяГруппы);
					
				КонецЕсли; 	
				ПутьКРеквизиту = "Таблица_" + Строка.НомерГруппы;
				Родитель = "Таблица_" + Строка.НомерГруппы;
			Иначе
				ПутьКРеквизиту = "";
				Родитель = ГруппаФормы.Имя;
			КонецЕсли;  
			
			Реквизит = Новый РеквизитФормы("Реквизит_" + Строка.НомерГруппы + "_" + Строка.НомерЭлемента, Новый ОписаниеТипов("Строка"), ПутьКРеквизиту, ЗаголовокРеквизита);
			ДобавляемыеРеквизиты.Добавить(Реквизит);
			
			НоваяСтрока = Форма.ТаблицаРеквизитов.Добавить();
			НоваяСтрока.Имя 	        = ИмяРеквизита;
			НоваяСтрока.ИмяЭлемента     = "Реквизит_" + Строка.НомерГруппы + "_" + Строка.НомерЭлемента;
			НоваяСтрока.Заголовок       = ЗаголовокРеквизита + " (" + Строка.ПолеБлока + ")";
			НоваяСтрока.ПутьКДанным     = ?(ПутьКРеквизиту = "", "", ПутьКРеквизиту + ".") +"Реквизит_" + Строка.НомерГруппы + "_" + Строка.НомерЭлемента; // 
			НоваяСтрока.Родитель		= Родитель;
			НоваяСтрока.ФорматнаяСтрока = Строка.ФорматнаяСтрока;
			НоваяСтрока.Видимость		= Строка.Видимость;
			НоваяСтрока.Обязательный	= Строка.Обязательное;
			НоваяСтрока.ИмяТаблицы		= Строка.ИмяТаблицы;
		КонецЕсли; 
		
	КонецЦикла;	
	
	ГруппаФормыСтатус = Форма.Элементы.Добавить("Группа_СтатусПорученияФШ", Тип("ГруппаФормы"), Форма.Элементы.СтраницаОсновное);
	ГруппаФормыСтатус.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормыСтатус.Отображение                = ОтображениеОбычнойГруппы.СлабоеВыделение;
	ГруппаФормыСтатус.Заголовок                  = "Статус поручения в файловом шлюзе";
	ГруппаФормыСтатус.ОтображатьЗаголовок        = Истина;
	ГруппаФормыСтатус.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	Строка20 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20));
	Реквизит = Новый РеквизитФормы("Реквизит_РегистрационныйНомерФШ", Строка20, , "Регистрационный номер");
	ДобавляемыеРеквизиты.Добавить(Реквизит);
	Реквизит = Новый РеквизитФормы("Реквизит_СтатусПорученияФШ", Новый ОписаниеТипов("Строка"), , "Статус поручения");
	ДобавляемыеРеквизиты.Добавить(Реквизит);
	Реквизит = Новый РеквизитФормы("Реквизит_КомментарийФШ", Новый ОписаниеТипов("Строка"), , "Комментарий (файловый шлюз)");
	ДобавляемыеРеквизиты.Добавить(Реквизит);
	
	//Таблица статусов выгрузки в ФШ
	//РеквизитДинамическийСписок = Новый РеквизитФормы("Таблица_СтатусыФШ", Новый ОписаниеТипов("ДинамическийСписок"), , "Статус выгрузки");
	//ДобавляемыеРеквизиты.Добавить(РеквизитДинамическийСписок);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого СтрокаРеквизит Из Форма.ТаблицаРеквизитов Цикл
		Если Найти(СтрокаРеквизит.ИмяЭлемента, "Таблица_") > 0 Тогда
			ЭлементФормы = Форма.Элементы.Добавить(СтрокаРеквизит.ИмяЭлемента, Тип("ТаблицаФормы"), Форма.Элементы[СтрокаРеквизит.Родитель]);
			ЭлементФормы.Заголовок = СтрокаРеквизит.Заголовок;
			ЭлементФормы.ПоложениеКоманднойПанели	= ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			ЭлементФормы.ТолькоПросмотр				= Истина;
			ЭлементФормы.ПутьКДанным 			    = СтрокаРеквизит.ПутьКДанным;
		Иначе
			ЭлементФормы = Форма.Элементы.Добавить(СтрокаРеквизит.ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы[СтрокаРеквизит.Родитель]);
			ЭлементФормы.Заголовок = СтрокаРеквизит.Заголовок;
			ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ТолькоПросмотр = Истина;
			ЭлементФормы.ПутьКДанным = СтрокаРеквизит.ПутьКДанным;
			ЭлементФормы.Видимость = СтрокаРеквизит.Видимость;
			Если СтрокаРеквизит.Обязательный Тогда
				ЭлементФормы.ЦветТекстаЗаголовка = WebЦвета.Красный;
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЦикла; 
	
	ЭлементФормы = Форма.Элементы.Добавить("Реквизит_РегистрационныйНомерФШ", Тип("ПолеФормы"), Форма.Элементы["Группа_СтатусПорученияФШ"]);
	ЭлементФормы.Заголовок = "Регистрационный номер";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПутьКДанным = "Реквизит_РегистрационныйНомерФШ";
	ЭлементФормы.Видимость = Истина;
	
	ЭлементФормы = Форма.Элементы.Добавить("Реквизит_СтатусПорученияФШ", Тип("ПолеФормы"), Форма.Элементы["Группа_СтатусПорученияФШ"]);
	ЭлементФормы.Заголовок = "Статус";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПутьКДанным = "Реквизит_СтатусПорученияФШ";
	ЭлементФормы.Видимость = Истина;	
	
	ЭлементФормы = Форма.Элементы.Добавить("Реквизит_КомментарийФШ", Тип("ПолеФормы"), Форма.Элементы["Группа_СтатусПорученияФШ"]);
	ЭлементФормы.Заголовок = "Комментарий";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПутьКДанным = "Реквизит_КомментарийФШ";
	ЭлементФормы.Видимость = Истина;	
	
	//Форма.Таблица_СтатусыФШ.ПроизвольныйЗапрос = Истина;
	//Форма.Таблица_СтатусыФШ.ТекстЗапроса = "ВЫБРАТЬ
	//|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус,
	//|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Комментарий
	//|ИЗ
	//|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(, ДОкумент.ДОкументОснование = &Поручение) КАК СостоянияДокументовВФайловомШлюзеСрезПоследних";
	//ПараметрПоручение = Форма.Таблица_СтатусыФШ.Параметры.Элементы.Найти("Поручение");
	//ПараметрПоручение.использование = Истина;
	//ПараметрПоручение.Значение = Форма.Объект.Ссылка;
	//
	//ЭлементФормы = Форма.Элементы.Добавить("Таблица_СтатусыФШ", Тип("ТаблицаФормы"), Форма.Элементы.СтраницаРеквизиты);
	////ЭлементФормы.Заголовок = СтрокаРеквизит.Заголовок;
	//ЭлементФормы.ПоложениеКоманднойПанели	= ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	//ЭлементФормы.ТолькоПросмотр				= Истина;
	//ЭлементФормы.ПутьКДанным 			    = "Таблица_СтатусыФШ";
КонецПроцедуры

Процедура УдалитьНезаполненныеЭлементыФормы(Форма)
	
	УдаляемыеРеквизиты	= Новый Массив;
	
	МассивВидимыхРеквизитов = Форма.ТаблицаРеквизитов.НайтиСтроки(Новый Структура("Видимость, Обязательный", Истина, Ложь));
	Для каждого СтрокаРеквизит Из МассивВидимыхРеквизитов Цикл
		Если Найти(СтрокаРеквизит.ПутьКДанным, "Таблица") > 0 Тогда
			Если СтрокаРеквизит.ИмяЭлемента = СтрокаРеквизит.ПутьКданным Тогда
				Если Форма[СтрокаРеквизит.ИмяЭлемента].Количество() = 0 Тогда
					УдаляемыеРеквизиты.Добавить(СтрокаРеквизит.ИмяЭлемента);
				Иначе
					МассивКолонок = Форма.ТаблицаРеквизитов.НайтиСтроки(Новый Структура("Видимость, Родитель", Истина, СтрокаРеквизит.ИмяЭлемента));
					Для каждого Колонка Из МассивКолонок Цикл
						КолонкаЗаполнена = Ложь;
						Для каждого Строка Из Форма[СтрокаРеквизит.ИмяЭлемента] Цикл
							Если ЗначениеЗаполнено(Строка[Колонка.ИмяЭлемента]) Тогда
								КолонкаЗаполнена = истина;
								Прервать;
							КонецЕсли; 
						КонецЦикла; 
						
						Если НЕ КолонкаЗаполнена Тогда
							УдаляемыеРеквизиты.Добавить(Колонка.ПутьКданным);
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли; 	
			КонецЕсли; 
		Иначе
			Если НЕ ЗначениеЗаполнено(Форма[СтрокаРеквизит.ИмяЭлемента]) Тогда
				УдаляемыеРеквизиты.Добавить(СтрокаРеквизит.ИмяЭлемента);
			КонецЕсли; 	
		КонецЕсли;	
		
	КонецЦикла; 
	
	Форма.ИзменитьРеквизиты(,УдаляемыеРеквизиты);
	
КонецПроцедуры

Процедура ЗаполнитьЭлементыФормы(Ссылка, Форма, СКД, ИмяНабораДанных)
	
	НаборДанных = СКД.НаборыДанных[ИмяНабораДанных];
	
	ИмяНабораДанных = СтрЗаменить(ИмяНабораДанных, "ТЧ_", "");
	
	Запрос = Новый Запрос(НаборДанных.Запрос);
	Запрос.УстановитьПараметр("Сделка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		МассивВидимыхРеквизитов = Форма.ТаблицаРеквизитов.НайтиСтроки(Новый Структура("Видимость", Истина));
		Для каждого СтрокаРеквизит Из МассивВидимыхРеквизитов Цикл
			ИмяРеквизита = СтрокаРеквизит.Имя;
			
			Если ИмяРеквизита = "" Тогда
				Продолжить;
			КонецЕсли;
			
			Если Найти(СтрокаРеквизит.ПутьКДанным, "Таблица") > 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Если Найти(ИмяРеквизита, "[") > 0 И Найти(ИмяРеквизита, "]") > 0 Тогда
				ТекстВыражения = СтрЗаменить(ИмяРеквизита, "[", "Выборка[""");
				ПозицияТочки = Найти(ТекстВыражения, ".");
				ПозицияЛевойСкобки = Найти(ИмяРеквизита, "[");
				Если ПозицияТочки > 0 И ПозицияТочки > ПозицияЛевойСкобки Тогда
					ТекстВыражения = Сред(ТекстВыражения, 1, ПозицияТочки - 1) + """]" + "." + СтрЗаменить(Сред(ТекстВыражения, ПозицияТочки + 1), "]", "");
				Иначе
					ТекстВыражения = СтрЗаменить(ТекстВыражения, "]", """]");
					//ПозицияСкобки = Найти(ИмяРеквизита, "]");
					//ТекстВыражения = СтрЗаменить(ТекстВыражения, "]", """]");
				КонецЕсли; 
				
				Попытка
					Значение = Вычислить(ТекстВыражения);
				Исключение
					Значение = "";
					Сообщить("Ошибка при вычислении поля """ + ИмяРеквизита + """ для заполнения реквизита """ + СтрокаРеквизит.Заголовок + """: " + ОписаниеОшибки());
				КонецПопытки;
				
				Если Значение <> "" Тогда
					Если СтрокаРеквизит.ФорматнаяСтрока = "" Тогда
						Форма[СтрокаРеквизит.ИмяЭлемента] = Значение;
					Иначе
						Форма[СтрокаРеквизит.ИмяЭлемента] = Формат(Значение, СтрокаРеквизит.ФорматнаяСтрока);
					КонецЕсли;
				КонецЕсли; 
				
			Иначе
				Форма[СтрокаРеквизит.ИмяЭлемента] = ИмяРеквизита;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Форма[СтрокаРеквизит.ИмяЭлемента]) И НЕ СтрокаРеквизит.Обязательный Тогда
				Форма.Элементы[СтрокаРеквизит.ИмяЭлемента].Видимость = Ложь;
				//Форма.Элементы[СтрокаРеквизит.ИмяЭлемента].ПутьКданным = "";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуФормы(Ссылка, Форма, СКД, ИмяНабораДанных)
	
	НаборДанных = СКД.НаборыДанных[ИмяНабораДанных];
	
	Запрос = Новый Запрос(НаборДанных.Запрос);
	Запрос.УстановитьПараметр("Сделка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ЭтоНеторговоеПоручениеСоСпискомЦБ", Документы.Поручение.ЭтоНеторговоеПоручениеСоСпискомЦБ(Ссылка));
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПапкиНабораДанных = Новый массив;
	Для каждого Поле Из НаборДанных.Поля Цикл
		Если ТипЗнч(Поле) = Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных") Тогда
			ПапкиНабораДанных.Добавить(Поле.Заголовок);
		КонецЕсли; 
	КонецЦикла; 
	
	МассивВидимыхРеквизитов = Форма.ТаблицаРеквизитов.НайтиСтроки(Новый Структура("Видимость", Истина));
	
	Пока Выборка.Следующий() Цикл
		СтрокаДобавлена = Ложь;
		
		Для каждого СтрокаРеквизит Из МассивВидимыхРеквизитов Цикл
			Если Найти(СтрокаРеквизит.ПутьКДанным, "Таблица") = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			ИмяРеквизита = СтрокаРеквизит.Имя;
			Если ИмяРеквизита = "" Тогда
				Продолжить;
			КонецЕсли; 
			
			Если ПапкиНабораДанных.Найти(СтрокаРеквизит.ИмяТаблицы) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			//Если Найти(ИмяРеквизита, "[") > 0 И Найти(ИмяРеквизита, "]") > 0 И Найти(ИмяРеквизита, ИмяНабораДанных) = 0 Тогда
			//	Продолжить;
			//КонецЕсли; 
			
			ИмяПоля = ИмяРеквизита;
			ИмяПоля = СтрЗаменить(ИмяПоля, "[", "");
			ИмяПоля = СтрЗаменить(ИмяПоля, "]", "");
			
			//ПолеНабораДанных = НаборДанных.Поля.Найти(ИмяПоля);
			//Если ПолеНабораДанных = Неопределено Тогда
			//	Продолжить;
			//КонецЕсли;				
			
			Если Не СтрокаДобавлена Тогда
				НовСтрока = Форма[СтрокаРеквизит.Родитель].Добавить();
				СтрокаДобавлена = Истина;
			КонецЕсли; 

			ИмяРеквизита = СтрЗаменить(ИмяРеквизита, ИмяНабораДанных + ".", "");
			
			Если Найти(ИмяРеквизита, "[") > 0 И Найти(ИмяРеквизита, "]") > 0 Тогда
				ТекстВыражения = СтрЗаменить(ИмяРеквизита, "[", "Выборка[""");
				ТекстВыражения = СтрЗаменить(ТекстВыражения, "]", """]");
				Попытка
					Значение = Вычислить(ТекстВыражения);
				Исключение
					Значение = "";
					Сообщить("Ошибка при вычислении поля """ + ИмяРеквизита + """ для заполнения реквизита """ + СтрокаРеквизит.Заголовок + """");
				КонецПопытки;
				
				Если Значение <> "" Тогда
					Если Найти(Значение, "[") > 0 Тогда
						ТекстВыражения = Значение;
						ТекстВыражения = СтрЗаменить(ТекстВыражения, "[", "Выборка.Поручение[");
						Попытка
							Значение = Вычислить(ТекстВыражения);
						Исключение
							Значение = "";
						КонецПопытки;
					КонецЕсли;
					
					Если ТипЗнч(Значение) = Тип("Строка") Тогда
						Значение = СтрЗаменить(Значение, """", "");
					КонецЕсли; 
					
					Если СтрокаРеквизит.ФорматнаяСтрока = "" Тогда
						НовСтрока[СтрокаРеквизит.ИмяЭлемента] = Значение;
					Иначе
						НовСтрока[СтрокаРеквизит.ИмяЭлемента] = Формат(Значение, СтрокаРеквизит.ФорматнаяСтрока);
					КонецЕсли;
				КонецЕсли; 
				
			Иначе
				НовСтрока[СтрокаРеквизит.ИмяЭлемента] = ИмяРеквизита;
			КонецЕсли;

		КонецЦикла; 
	КонецЦикла; 
	
 КонецПроцедуры

Процедура ЗаполнитьСтатус_ФШ(Ссылка, Форма)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Комментарий
	|ИЗ
	|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(, Документ В (ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ.ТехническаяОперация ГДЕ ДОкументОснование = &Ссылка УПОРЯДОЧИТЬ ПО Дата УБЫВ)) КАК СостоянияДокументовВФайловомШлюзеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Форма["Реквизит_СтатусПорученияФШ"] = Выборка.Статус;
		Форма["Реквизит_КомментарийФШ"] = Выборка.Комментарий;
	КонецЕсли; 
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехническаяОперация.РегистрационныйНомер КАК РегистрационныйНомер
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехническаяОперация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|		ПО ТехническаяОперация.ДокументОснование = НеттоПоручениеПоручения.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТехническаяОперация.ДокументОснование ССЫЛКА Документ.Поручение
	|				ТОГДА ТехническаяОперация.ДокументОснование = &Поручение
	|			КОГДА ТехническаяОперация.ДокументОснование ССЫЛКА Документ.НеттоПоручение
	|				ТОГДА НеттоПоручениеПоручения.Поручение = &Поручение
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТехническаяОперация.Дата УБЫВ";
	Запрос.УстановитьПараметр("Поручение", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Форма["Реквизит_РегистрационныйНомерФШ"] = Выборка.РегистрационныйНомер;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИсправитьКолонкиНаФормеНаРазрешенныеЗначения(ТаблицаОтображения, ВидПоручения)
	
	РазрешенныеЗначенияСтр = "1,2,3,4,5,6,7,8,9";
	РазрешенныеЗначения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РазрешенныеЗначенияСтр);
	Ошибка = Ложь;
	Для Каждого Строка Из ТаблицаОтображения Цикл
		Если НЕ ЗначениеЗаполнено(Строка.КолонкаНаФорме) Тогда
			Строка.КолонкаНаФорме = РазрешенныеЗначения[0];
		КонецЕсли;
		Если РазрешенныеЗначения.Найти(Строка.КолонкаНаФорме) = Неопределено Тогда
			Ошибка = Истина;
			Строка.КолонкаНаФорме = РазрешенныеЗначения[0];
		КонецЕсли;
	КонецЦикла;
	Если Ошибка Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В справочнике ""Виды инвентарных поручений"" с кодом " + ВидПоручения.Код
			+ " обнаружено запрещенное значение колонки на форме." + Символы.ПС
			+ "Разрешенные значения: " + РазрешенныеЗначенияСтр;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ИсправитьКолонкиНаФормеНаОдноЗначениеВнутриГруппы(ТаблицаОтображения, ВидПоручения)
	
	ТекущаяГруппа = "<Неопределено>";
	ТекущаяКолонка = "";
	Ошибка = Ложь;
	Для Каждого Строка Из ТаблицаОтображения Цикл
		Если Строка.НомерГруппы <> ТекущаяГруппа Тогда
			ТекущаяГруппа = Строка.НомерГруппы;
			ТекущаяКолонка = Строка.КолонкаНаФорме;
		Иначе
			Если Строка.КолонкаНаФорме <> ТекущаяКолонка Тогда
				Ошибка = Истина;
				Строка.КолонкаНаФорме = ТекущаяКолонка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Ошибка Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В справочнике ""Виды инвентарных поручений"" с кодом " + ВидПоручения.Код
			+ " обнаружены различные номера колонок на форме в пределах одной группы.";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Функция КолонкиГруппНаФорме(ТаблицаОтображения)
	
	КолонкиНаФорме = ТаблицаОтображения.Скопировать(, "НомерГруппы, КолонкаНаФорме");
	КолонкиНаФорме.Свернуть("НомерГруппы, КолонкаНаФорме");
	КолонкиГрупп = Новый Соответствие;
	Для Каждого Строка Из КолонкиНаФорме Цикл
		КолонкиГрупп.Вставить(Строка.НомерГруппы, Строка.КолонкаНаФорме);
	КонецЦикла;
	Возврат КолонкиГрупп;
	
КонецФункции

Процедура СоздатьКолонкиНаФорме(Форма, ЭлементРодитель, ТаблицаОтображения)
	
	ЭлементРодитель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	КолонкиНаФорме = ТаблицаОтображения.Скопировать(, "КолонкаНаФорме");
	КолонкиНаФорме.Свернуть("КолонкаНаФорме");
	КолонкиНаФорме.Сортировать("КолонкаНаФорме");
	Для Каждого Строка Из КолонкиНаФорме Цикл
		ИмяНовойКолонки = "РеквизитыКолонка" + Строка.КолонкаНаФорме;
		Если Форма.Элементы.Найти(ИмяНовойКолонки) = Неопределено Тогда
			ГруппаКолонки = Форма.Элементы.Добавить(ИмяНовойКолонки, Тип("ГруппаФормы"), ЭлементРодитель);
			ГруппаКолонки.Вид			= ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКолонки.Отображение	= ОтображениеОбычнойГруппы.Нет;
			ГруппаКолонки.ОтображатьЗаголовок	= Ложь;
			ГруппаКолонки.Группировка	= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
